Repository: zikula-modules/Avatar
Catalog: Avatar/locale/*/LC_MESSAGES/module_avatar.po
Languages: de

source: Error! This module can only be used if the Profile module is installed and if it is set in the Settings module as the default profile module.
de: Fehler! Dieses Modul kann nur genutzt werden, wenn das Modul 'Profile' installiert ist und als Standard Profilmodul im Modul 'Settings' ausgewählt wurde.

source: Error! The user attribute called 'avatar' doesn't exist. Please install a Profile module if you want to use this module.
de: Fehler! Das Benutzerattribut namens 'avatar' scheint nicht zu existieren. Das Avatar-Modul kann nur eingesetzt werden, wenn ein Profil-Modul installiert ist.

source: Error! No avatar choosen.
de: Fehler! Es wurde kein Avatar ausgewählt.

source: Warning! This avatar is in use and cannot be deleted. If you want to delete it, please change the avatars of the users listed below.
de: Warnung! Dieser Avatar ist bereits in Benutzung und kann daher nicht gelöscht werden. Die Löschung ist nur möglich, wenn die Avatarzuordnung der folgenden Benutzer geändert wird.

source: Upload of individual Avatars
de: Auswahl und Upload individueller Avatare

source: The path %s does not exist or is not readable by the webserver.
de: Das Verzeichnis %s existiert nicht oder ist für den Webserver nicht beschreibbar.

source: The webserver cannot write to %s.
de: Das Verzeichnis %s ist für den Webserver nicht beschreibbar.

source: Error! Missing path.
de: Fehler! Verzeichnisangabe fehlt.

source: Done! The avatar of the user '%s' has been disabled.
de: Erledigt! Die Avataranzeige des Benutzers '%s' wurde deaktiviert.

source: Done! The avatar of the user '%s' has been set to his gravatar.
de: Erledigt! Für den Benutzer '%s' wird jetzt das entsprechende Gravatar-Bild angezeigt.

source: Done! The avatar of the user '%1$s' has been changed to '%2$s'
de: Erledigt! Der Avatar des Benutzer '%1$s' wurde auf '%2$s' geändert.

source: Error! The user is not authorized to use this avatar. To change this, update the permission for %s.
de: Fehler! Der Benutzer darf diesen Avatar nicht auwählen. Das ist nur möglich, wenn die Zugriffsrechte für %s geändert werden.

source: Error! You aren't a registered user.
de: Fehler! Es liegt keine Anmeldung im System vor.

source: Error! No file selected.
de: Fehler! Keine Datei ausgewählt.

source: Error! Filesize error, max %s bytes are allowed.
de: Fehler! Dateigröße fehlerhaft. Maximal %s Bytes erlaubt.

source: Error! The file is not an image.
de: Fehler! Bei dieser Datei handelt es sich nicht um ein Bild.

source: Error! Unauthorised file extension. Allowed extensions: %s.
de: Fehler! Nicht erlaubte Dateiendung. Mögliche Dateierweiteurngen: %s.

source: Error! Image height (max. %1$s px) or width (max. %2$s px) error.
de: Fehler! Bildhöhe (max. %1$s px) oder Bildbreite (max. %2$s px) fehlerhaft.

source: Error! Fail to copy the file in avatar's directory.
de: Fehler! Der Kopiervorgang in das Avatar-Verzeichnis ist fehlgeschlagen.

source: Error! Fail to copy the file in phpbb's directory.
de: Fehler! Der Kopiervorgang in das phpbbb-Verzeichnis ist fehlgeschlagen.

source: Error while selecting the avatar.
de: Fehler bei der Auswahl des Avatars.

source: Avatar Management
de: Avatar-Verwaltung

source: Maintain avatars
de: Avatare verwalten

source: Search user
de: Benutzer suchen

source: Modify configuration
de: Konfiguration modifizieren

source: Error! Unable to delete avatar '%s'.
de: Fehler! Avatar '%s' konnte nicht gelöscht werden.

source: Done! The Avatar '%s' has been deleted.
de: Erledigt! Der Avatar '%s' wurde gelöscht.

source: View avatars
de: Avatare anzeigen

source: Upload avatar
de: Avatar hochladen

source: Your current avatar is:
de: Der aktuelle Avatar ist:

source: Currently no avatar selected
de: Derzeit ist kein Avatar ausgewählt

source: Select the number of avatars to be displayed per page
de: Anzahl der anzuzeigenden Avatare pro Seite

source: All
de: Alle

source: Submit
de: Absenden

source: List users that use this avatar
de: Benutzer anzeigen, die diesen Avatar ausgewählt haben

source: View
de: Anzeigen

source: Delete avatar
de: Avatar löschen

source: Delete
de: Löschen

source: Upload settings
de: Upload-Einstellungen

source: Avatar Directory
de: Avatarverzeichnis

source: Please configure the avatar path in the <a href="%s">Users administration</a>
de: Bitte das Avatarverzeichnis in der <a href="%s">Benutzeraadministration</a> konfigurieren

source: Warning! The webserver cannot write to the avatar direcory.
de: Warnung! Das Avatarverzeichnis ist für den Webserver nicht beschreibbar.

source: Avatar Directory (PNphpBB2)
de: Avatarverzeichnis (PNphpBB2)

source: Warning! The webserver cannot write to the forums avatar direcory (this is fine when PNphpBB2 isn't installed).
de: Warnung! Das Forumverzeichnis ist nicht beschreibbar. Das ist in Ordnung falls das Modul PNphpBB2 nicht installiert ist.

source: Resize the avatar automatically
de: Automatische Verkleinerung der Avatarbilder

source: Max. avatar filesize in bytes
de: Maximale Dateigröße eines Avatars in Bytes

source: Max. height in pixels
de: Maximale Höhe in Pixel

source: Max. width in pixels
de: Maximale Breite in Pixel

source: Allowed extensions
de: Erlaubte Dateiendungen

source: A semicolon separated list of allowed file extensions, supported filetypes: gif, jpg, jpeg, png, wbm. When using PHP 5 or later you have to allow 'jpeg' instead of 'jpg'.
de: Eine durch Semikolons getrennte Liste erlaubter Dateiendungen. Unterstützt werden: gif, jpg, png, wbm. Bei Verwendung von mind. PHP 5 muss 'jpeg' anstelle von 'jpg' verwendet werden.

source: Allow multiple avatars
de: Mehrere Avatare erlauben

source: This allows the user to store one avatar per extension
de: Benutzer erlauben jeweils ein Avatar pro Dateiendung abzuspeichern.

source: Confirm deletion
de: Löschen bestätigen

source: Selected avatar
de: Ausgewählter Avatar

source: Users who don't use a avatar
de: Benutzer, die keinen Avatar ausgewählt haben

source: Users who use this avatar
de: Benutzer, die diesen Avatar ausgewählt haben

source: Select new avatar
de: Neuen Avatar auswählen

source: No user is using this avatar.
de: Der Avatar ist von keinem Benutzer ausgewählt worden.

source: Choose the avatar to update all selected users
de: Bitte einen Avatar auswählen, der den auswählten Benutzern zugeordnet werden soll

source: If no available avatar represents you, you can upload a personalised avatar.
de: Falls die vorhandenen Avatare nicht gefallen, kann auch ein personalisiertes Avatarbild hochgeladen werden.

source: Upload file
de: Datei hochladen

source: Upload
de: Hochladen

source: Clear
de: Eingaben löschen

source: Possible extensions
de: Erlaubte Dateiendungen

source: Avatar max. file size
de: Maximale Dateigröße des Avatars

source: Maximal avatar dimensions
de: Maximale Avatargröße

source: pixels
de: Pixel

source: Larger images will be resized automatically.
de: Größere Bilder werden automatisch verkleinert.

source: Enter user name
de: Benutzernamen eingeben

source: Edit
de: Bearbeiten

source: The current avatar of '%s' is:
de: Der aktuelle Avatar von '%s' ist:

source: The user has no avatar selected.
de: Der Benutzer hat kein Avatar gewählt.

source: Please choose your prefered avatar
de: Bitte einen bevorzugten Avatar auswählen

source: This site also supports <a href="http://www.gravatar.com">gravatars</a>. If you have a gravatar then select the gravatar logo as your avatar.
de: Diese Website bietet außerdem auch <a href="http://www.gravatar.com">Gravatar</a>-Unterstützung an. Falls ein Gravatar - für die im System hinterlegte E-Mail-Adresse - vorhanden ist, kann dieser über einen Klick auf das Gravatar-Logo aktiviert werden.

source: Use your gravatar
de: Gravatar benutzen

source: Deactivate your avatar
de: Avataranzeige deaktivieren

source: If you don't want that an avatar is displayed for you, then please click <a href="%1$s">here</a> to clear your avatar.
de: Falls kein Avatar angezeigt werden soll, so kann die Einstellung <a href="%1$s">hier</a> zurückgesetzt werden.

source: Visit Avatar project at http://code.zikula.org/avatar/
de: Avatar-Projektseite unter http://code.zikula.org/avatar/ besuchen
